tutorials/rigidBodyAndBeam_loop/system/beam/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     beamFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         3;

deltaT          0.001;

writeControl    timeStep;
writeInterval   50;

purgeWrite      0;

writeFormat     ascii;
writePrecision  6;
writeCompression uncompressed;

timeFormat      general;
timePrecision   6;

runTimeModifiable yes;

functions
{
    beamDisplacements
    {
        type    beamDisplacements;
        historyPatch    right;
    }

    beamForcesMoments
    {
        type    beamForcesMoments;
        historyPatch    left;
    }
}

// ************************************************************************* //
